diffeq.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+OPTIONS: toc:nil
* Задача 1194
Найти поверхность, удовлетворяющую уравнению:
$$y^2\frac{\partial{z}}{\partial{x}} + xy\frac{\partial{z}}{\partial{y}} = x$$
и проходящую через линию:
$$x = 0,\, z = y^2$$

УЧП соответствует системе:
$$\frac{dx}{y^2} = \frac{dy}{xy} = \frac{dz}{x}\, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 = 2 \Rightarrow xydx = y^2dy \Rightarrow d(x^2) = d(y^2) \Rightarrow x^2 - y^2 = C_1$$
$$2 = 3 \Rightarrow \frac{dy}{y} = dz \Rightarrow d(\ln{y}) = dz \Rightarrow z - \ln{y} = C_2$$
Тогда общее решение имеет вид:
$$z - \ln{y} = F(x^2 - y^2)$$
где $F(x, y)$ - произвольная дифференцируемая функция от $x$ и $y$.

Подставим в это решение уравнение линии:
$$y^2 - \ln{y} = F(-y^2) \Rightarrow F(x) = -x + \ln{\sqrt{-x}}$$
Таким образом, решение имеет вид:
$$z = \ln{y} - x^2 + y^2 - \ln{\sqrt{x^2 - y^2}}$$

* Задача 1198
Найти поверхность, удовлетворяющую уравнению:
$$x\frac{\partial{z}}{\partial{x}} - y\frac{\partial{z}}{\partial{y}} = z^2(x - 3y)$$
и проходящую через линию:
$$x = 1,\, yz + 1 = 0$$

УЧП соответствует системе:
$$\frac{dx}{x} = \frac{dy}{-y} = \frac{dz}{z(x - 3y)}\, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 = 2 \Rightarrow \frac{dx}{x} = \frac{dy}{-y} \Rightarrow xy = C_1$$
$$1 \cdot z + 2 \cdot 3z = 3 \Rightarrow dx + 3dy = \frac{dz}{z} \Rightarrow x + 3y - \ln{|z|} = C_2$$
Подставим в эти выражения уравнение кривой, чтобы найти связь между $C_1$ и $C_2$:
\begin{equation*}
  \begin{cases}
    y = C_1,\\
    1 + 3y + \ln{|y|} = C_2
  \end{cases}
\end{equation*}
Откуда получаем:
$$C_2 = 1 + 3C_1 + \ln{|C_1|} \Rightarrow x + 3y - \ln{z} = 1 + 3xy + \ln{|xy|}$$
Или, выражая $z$ через $x$ и $y$:
$$z = \exp{(x + 3y - 1 - 3xy - \ln{|xy|})}$$

* Задача 1203
Найти поверхность, удовлетворяющую уравнению:
$$(y - z)\frac{\partial{z}}{\partial{x}} + (z - x)\frac{\partial{x}}{\partial{y}} = x - y$$
и проходящую через линию:
$$z = y = -x$$

УЧП соответствует системе:
$$\frac{dx}{y - z} = \frac{dy}{z - x} = \frac{dz}{x - y}\, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 + 2 = -3 \Rightarrow dx + dy = -dz \Rightarrow x + y + z = C_1$$
$$1 \cdot 2x + 2 \cdot 2y = -3 \cdot 2z \Rightarrow x^2 + y^2 + z^2 = C_2$$
Тогда общее решение имеет вид:
$$x^2 + y^2 + z^2 = F(x + y + z)$$
Где $F(x)$ - произвольная дифференцируемая функция.

Подставим в это соотношение уравнение кривой:
$$3x^2 = F(x)$$
Откуда итоговое решение имеет вид:
$$x^2 + y^2 + z^2 = 3(x + y + z)^2$$

* Задача 1204
Найти поверхность, удовлетворяющую уравнению:
$$x\frac{\partial{z}}{\partial{x}} + (xz + y)\frac{\partial{z}}{\partial{y}} = z$$
и проходящую через линию:
$$x + y = 2z,\, xz = 1$$

УЧП соответствует системе:
$$\frac{dx}{x} = \frac{dy}{xz + y} = \frac{dz}{z}\, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 = 3 \Rightarrow \frac{dx}{x} = \frac{dz}{z} \Rightarrow \frac{z}{x} = C_1$$
$$1 \cdot z + 3 \cdot x - 2 = 1 \Rightarrow \frac{xdz + zdx - dy}{xz - y} = \frac{dx}{x} \Rightarrow \frac{xz - y}{x} = C_2$$

Подставим в найденные первые интегралы уравнение кривой и найдём соотношение между $C_1$ и $C_2$:
\begin{equation*}
  \begin{cases}
    C_1 = \frac{1}{x^2},\\
    C_2 = 1 - \frac{y}{x} = 1 - \frac{2z - x}{x} = 2 - 2\frac{z}{x} = 2 - 2C_1
  \end{cases}
\end{equation*}

Откуда, подставляя значения первых интегралов, получаем:
$$\frac{xz - y}{x} = 2 - 2\frac{z}{x}$$

* Задача 1206
Найти поверхность, удовлетворяющую уравнению:
$$x\frac{\partial{z}}{\partial{x}} + z\frac{\partial{z}}{\partial{y}} = y$$
и проходящую через линию:
$$y = 2z,\, x + 2y = z$$

УЧП соответствует системе:
$$\frac{dx}{x} = \frac{dy}{z} = \frac{dz}{y}\, (1 = 2 = 3)$$
Найдём первые интегралы:
$$2 = 3 \Rightarrow ydy = zdz \Rightarrow z^2 - y^2 = C_1$$
$$1 = 2 + 3 \Rightarrow \frac{dx}{x} = \frac{dy + dz}{y + z} \Rightarrow \frac{y + z}{x} = C_2$$

Таким образом, общее решение имеет вид:
$$F\left(z^2 - y^2, \frac{y + z}{x}\right) = 0$$
Где $F(x, y)$ - произвольная дифференцируемая функция двух аргументов. Подставим в неё уравнение кривой,
предварительно преобразовав его:
\begin{equation*}
  \begin{cases}
    y = 2z,\\
    x = z - 2y = -3z
  \end{cases}
\end{equation*}
$$F(-3z^2, -1) = 0$$

Таким образом, уравнение искомой поверхности имеет вид:
\begin{equation*}
  \begin{cases}
    F\left(z^2 - y^2, \frac{y + z}{x}\right) = 0,\\
    F(-3x^2, -1) = 0
  \end{cases}
\end{equation*}

* Задача 1174
Найти общее решение уравнения:
$$xy\frac{\partial{z}}{\partial{x}} - x^2\frac{\partial{z}}{\partial{y}} = yz$$

УЧП соответствует системе:
$$\frac{dx}{xy} = \frac{dy}{x^2} = \frac{dz}{yz} \, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 = 2 \Rightarrow ydy = xdx \Rightarrow y^2 - x^2 = C_1$$
$$1 = 3 \Rightarrow \frac{dx}{x} = \frac{dz}{z} \Rightarrow \frac{z}{x} = C_2$$

Отсюда, общее решение имеет вид:
$$\frac{z}{x} = F(y^2 - x^2)$$
Где $F(x)$ - произвольная дифференцируемая функция.

* Задача 1186
Найти общее решение уравнения:
$$(y + z)\frac{\partial{u}}{\partial{x}} + (z + x)\frac{\partial{u}}{\partial{y}} + (x + y)\frac{\partial{u}}{\partial{z}} = u$$

УЧП соответствует системе:
$$\frac{dx}{y + z} = \frac{dy}{z + x} = \frac{dz}{x + y} = \frac{du}{u} \, (1 = 2 = 3 = 4)$$
Найдём первые интегралы:
$$1 + 2 + 3 = 4 \Rightarrow \frac{dx + dy + dz}{2(x + y + z)} = \frac{du}{u} \Rightarrow \frac{u^2}{x + y + z} = C_1$$
$$1 - 2 = 4 \Rightarrow \frac{dx - dy}{y - x} = \frac{du}{u} \Rightarrow u(x - y) = C_2$$
$$2 - 3 = 4 \Rightarrow \frac{dy - dz}{z - y} = \frac{du}{u} \Rightarrow u(y - z) = C_3$$

Таким образом, общее решение имеет вид:
$$F\left(\frac{u^2}{x + y + z}, u(x - y), u(y - z)\right) = 0$$
Где $F(x, y, z)$ - произвольная дифференцируемая функция.

* Задача 1209
Найти поверхность, удовлетворяющую уравнению:
$$xy^3\frac{\partial{z}}{\partial{x}} + x^2z^2\frac{\partial{z}}{\partial{y}} = y^3z$$
и проходящую через кривую:
$$x = -z^3, \, y = z^2$$

УЧП соответствует системе:
$$\frac{dx}{xy^3} = \frac{dy}{x^2z^2} = \frac{dz}{y^3z} \, (1 = 2 = 3)$$
Найдём первые интегралы:
$$1 = 3 \Rightarrow \frac{dx}{x} = \frac{dz}{z} \Rightarrow \frac{z}{x} = C_1$$
$$1 \cdot z + 3 \cdot x = 2 \Rightarrow \frac{zdx + xdz}{xy^2z} = \frac{dy}{x^2z^2} \Rightarrow xzd(xz) = y^2dy \Rightarrow \frac{x^2z^2}{2} - \frac{y^3}{3} = C_2$$

Подставим сюда уравнение кривой, чтобы найти соотношение между $C_1$ и $C_2$:
\begin{equation*}
  \begin{cases}
    C_1 = -\frac{1}{z^2},\\
    C_2 = \frac{z^8}{2} - \frac{z^6}{3}
  \end{cases}
\end{equation*}
Получаем, что $C_2 = \frac{1}{2C_1^4} + \frac{1}{3C_1^3}$, откуда уравнение искомой поверхности имеет вид:
$$\frac{x^2z^2}{2} - \frac{y^3}{3} = \frac{x^4}{2z^4} + \frac{x^3}{3z^3}$$
75, 81, 83, 88, 72, 74, 76, 78, 155, 156
