diffeq.org
* Задача 75
Найти экстремали функционала $J[y] = \int_0^\pi(4y\cos x + y'^2 - y^2)dx, y(0) = y(\pi) = 0$.

Экстремалями являются решения уравнения:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
Где $F(x, y, y') = 4y\cos x + y'^2 - y^2$.
$$F_y = 4\cos x - 2y$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}2y' = 2y''$$
Получили уравнение:
$$4\cos x - 2y - 2y'' = 0$$
Или:
$$y'' + y = 4\cos x$$
Общее решение однородного уравнения имеет вид:
$$y_{oo} = C_1\sin x + C_2\cos x$$
Частное решение неоднородного уравнения ищем в виде:
#+BEGIN_EXPORT latex
\begin{multline*}
y_{np} = x(a\sin x + b\cos x) \Rightarrow y'_{np} = x(a\cos x - b\sin x) + (a\sin x + b\cos x) \Rightarrow\\
\Rightarrow y''_{np} = x(-a\sin x - b\cos x) + (a(\cos x + \sin x) + b(\cos x - \sin x)) \Rightarrow\\
\Rightarrow y''_{np} + y_{np} = (a + b)\cos x + (a - b)\sin x = \cos x \Rightarrow a = b = \frac{1}2
\end{multline*}
#+END_EXPORT
Таким образом, общее решение уравнения Эйлера имеет вид:
$$y_{no} = \left(C_1 + \frac{1}2x\right)\sin x + \left(C_2 + \frac{1}2x\right)\cos x$$
Для нахождения экстремалей подставим в решение граничные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
C_2 = 0, \\
C_2 + \frac{\pi}2 = 0,
\end{cases}
\Rightarrow
\begin{cases}
C_2 = 0, \\
C_2 = -\frac{\pi}2
\end{cases}
\end{equation*}
#+END_EXPORT
Таким образом, экстремалей нет.
* Задача 81
Найти экстремали функционала:
$$J[y(x)] = \int_a^b[2xy + (x^2 + e^y)y']dx, y(a) = A, y(b) = B$$

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 2x + y'e^y$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}(x^2 + e^y) = 2x + y'e^y$$
Получили уравнение:
$$0 = 0$$
Таким образом, любая кривая, удовлетворяющая граничным условиям будет экстремалью.
* Задача 83
Найти экстремали функционала:
$$J[y(x)] = \int_0^{\frac{\pi}4}(y'^2 - y^2)dx; y(0) = 1, y\left(\frac{\pi}4\right) = \frac{\sqrt 2}2$$
ВЫпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 2y$$
$$F_{y'} = \frac{d}{dx}(2y') = 2y''$$
Получаем уравнение:
$$2y - 2y'' = 0$$
Общее решение этого уравнения имеет вид:
$$y_{oo} = C_1e^x + C_2e^{-x}$$
Чтобы найти экстремали, подставим граничные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
C_1 + C_2 = 1, \\
C_1e^{\frac{\sqrt 2}2} + C_2e^{-\frac{\sqrt 2}2} = \frac{\sqrt 2}2
\end{cases}
\Rightarrow
\begin{cases}
C_1 + C_2 = 1, \\
C_1e^{\sqrt 2} + C_2 = \frac{\sqrt 2}2e^{\frac{\sqrt 2}2}
\end{cases}
\Rightarrow
\begin{cases}
C_1 = \frac{\sqrt 2e^{\frac{\sqrt 2}2} - 1}{2(e^{\sqrt 2} - 2)}, \\
C_2 = 1 - C_2
\end{cases}
\end{equation*}
#+END_EXPORT
Таким образом, единственной экстремалью является функция $y = C_1e^x + C_2e^{-x}$, где $C_1$ и $C_2$ определяются
из системы выше.
* Задача 88
Найти экстремали функционала:
$$J[y(x)] = \int_0^1(2e^y - y^2)dx; y(0) = 1, y(1) = e$$

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 2e^y - 2y$$
$$\frac{d}{dx}F_{y'} = 0$$
Получили уравнение:
$$2e^y - 2y = 0$$
Или:
$$y = e^y$$
При подстановке $x = 0$ получаем противоречие:
$$1 = e$$
Т. е. экстремалей нет.
* Задача 72
Найти экстремали функционала:
$$J[y] = \int_1^2(y'^2 + 2yy' + y^2)dx; y(1) = 1, y(2) = 0$$

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 2y' + 2y$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}(2y' + 2y) = 2y'' + 2y'$$
Получили уравнение:
$$2y - 2y'' = 0$$
Общее решение этого уравнения имеет вид:
$$y = C_1e^x + C_2e^{-x}$$
Подставим начальные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
C_1e + \frac{C_2}e = 1, \\
C_1e^2 + \frac{C_2}{e^2} = 0
\end{cases}
\Rightarrow
\begin{cases}
C_1 = \frac{1}{e + e^3}, \\
C_2 = \frac{e^3}{e^2 + 1}
\end{cases}
\end{equation*}
#+END_EXPORT
Откуда экстремалью является функция:
$$y = \frac{e^x + e^{4 - x}}{e^3 + e}$$
* Задача 74
Найти экстремали функционала:
$$J[y] = \int_0^1yy'^2dx; y(0) = 1, y(1) = \sqrt[3]4$$

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = y'^2$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}(2yy') = 2y'^2 + 2yy''$$
Получили уравнение:
#+BEGIN_EXPORT latex
\begin{equation}
2yy'' - y'^2 = 0
\end{equation}
#+END_EXPORT
Положим $y' = p(y)$, тогда $y'' = p'p$ и уравнение преобразуется к виду:
$$2yp'p - p'^2 = 0$$
Или:
$$p'(p' - 2py) = 0$$
Если $p' = 0$, то $p = C \Rightarrow y' = C \Rightarrow y = C_1x + C_2$. Подставив эту функцию в уравнение (1), найдём,
что $y = C$.
В противном случае уравнение приводится к виду:
$$\frac{p'}p = 2y \Rightarrow p = Cy^2, C \neq 0$$
Откуда $y' = Cy^2 \Rightarrow \frac{y'}{y^2} = C, C \neq 0 \Rightarrow y = \frac{1}{C_1x + C_2}, C_1 \neq 0$.

Объединяя это решение с предыдущим, получим:
$$y = \frac{1}{C_1x + C_2}, C_1^2 + C_2^2 \neq 0$$
Подставим граничные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{dcases}
\frac{1}{C_2} = 1, \\
\frac{1}{C_1 + C_2} = \sqrt[3]4
\end{dcases}
\Rightarrow
\begin{dcases}
C_1 = \sqrt[3]{\frac{1}4} - 1, \\
C_2 = 1
\end{dcases}
\end{equation*}
#+END_EXPORT
Получили единственную экстремаль:
$$y = \frac{\sqrt[3]4}{(1 - \sqrt[3]4)x + \sqrt[3]4}$$
* Задача 76
Найти экстремали функционала $J[y] = \int_0^1(y'^2 - y^2 - y)e^{2x}dx, y(0) = 0, y(1) = e^{-1}$.

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = (2y - 1)e^{2x}$$
$$\frac{d}{dx}F_{y'}= \frac{d}{dx}(2ye^{2x}) = e^{2x}(2y' + 4y)$$
Получили уравнение:
$$e^{2x}(2y' - 2y + 1) = 0$$
Или:
$$y' - y = \frac{1}2$$
Общее решение этого уравнения имеет вид:
$$y = Ce^x - \frac{1}2$$
Подставим начальные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
C\cdot1 - \frac{1}2 = 0, \\
Ce - \frac{1}2 = e^{-1}
\end{cases}
\Rightarrow
\begin{cases}
C = \frac{1}2, \\
C = \frac{e^{-1} + 2^{-1}}e
\end{cases}
\end{equation*}
#+END_EXPORT
Система несовместна, значит экстремалей нет.
* Задача 78
Найти экстремали функционала $J[y] = \int_{-1}^0(y'^2 - 2xy)dx, y(-1) = 0, y(0) = 2$.

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 2x$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}(2y') = 2y''$$
Получили уравнение:
$$y'' = x \Rightarrow y' = \frac{x^2}2 + C_1 \Rightarrow y = \frac{x^3}6 + C_1x + C_2$$
Подставим граничные условия:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
-\frac{1}6 - C_1 + C_2 = 0, \\
C_2 = 2
\end{cases}
\Leftrightarrow
\begin{cases}
C_1 = \frac{11}6, \\
C_2 = 2
\end{cases}
\end{equation*}
#+END_EXPORT
Таким образом, единственной экстремалью является кривая
$$y = \frac{x^3}6 + \frac{11}6x + 2$$
* Задача 155
Исследовать функционал на экстремум: $J[y] = \int_2^3\frac{x^3}{y'^2}dx; y(2) = 4, y(3) = 9$.

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = 0$$
#+BEGIN_EXPORT latex
\begin{multline*}
\frac{d}{dx}F_{y'} = \frac{d}{dx}\left(-2\frac{x^3}{y'^3}\right) = -2\frac{3x^2y'^3 - 3y'^2y''x^3}{y'^6}
= 6\frac{x^3y'' - x^2y'}{y'^4}
\end{multline*}
#+END_EXPORT

Получили уравнение:
#+BEGIN_EXPORT latex
\begin{multline*}
\begin{cases}
x^2(xy'' - y') = 0, \\
y' \neq 0
\end{cases}
\end{multline*}
#+END_EXPORT
$x = 0$ и $y = 0$ - не решения, поэтому уравнение приводится к виду:
$$y'' - \frac{1}xy' = 0 \Leftrightarrow (\ln y')' = (\ln |x|)' \Leftrightarrow y' = Cx, C \neq 0
\Leftrightarrow y = Cx^2 + C_1, C \neq 0$$
Допустимые значения $C$ и $C_1$ найдём, исходя из граничных условий:
#+BEGIN_EXPORT latex
\begin{equation*}
\begin{cases}
4C + C_1 = 4, \\
9C + C_1 = 9
\end{cases}
\Leftrightarrow
\begin{cases}
C = 1, \\
C_1 = 0
\end{cases}
\end{equation*}
#+END_EXPORT
Т. е. экстремум может достигаться только на кривой $y = x^2$. Эта кривая может быть включена в поле экстремалей
$y = Cx^2$.

Найдём $F_{y'y'}$
$$F_{y'y'} = 6\frac{x^3}{y'^4} =|_{y = y_0} = 4x^2 = 0 \text{ при } x = 0$$
Это означает, что слабого экстремума на этой кривой нет, а значит, и сильного.
