diffeq.tex
\section{Задача 156}
\label{sec:orgeffe4b8}
Исследовать функционал на экстремум: \(J[y] = \int_1^2(xy'^4 - 2yy'^3)dx; y(1) = 0, y(2) = 1\).

Выпишем уравнение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = 0$$
$$F_y = -2y'^3$$
$$\frac{d}{dx}F_{y'} = \frac{d}{dx}(4xy'^3 - 6yy'^2) = 4y'^3 + 12xy'^2y'' - 6y'^3 - 12yy'y''$$
Получили уравнение:
$$12yy'y'' - 12xy'^2y'' = 0$$
Или:
$$y'y''(y - xy') = 0$$
Если \(y'' = 0\), то \(y = C_1x + C_2\), иначе уравнение принимает вид:
$$\frac{y'}y = \frac{1}x \Leftrightarrow y = Cx, C \neq 0$$
Таким образом, все экстремали имеют вид:
$$y = C_1x + C_2$$
Проверим краевые условия:
\begin{equation*}
\begin{cases}
C_1 + C_2 = 0, \\
2C_1 + C_2 = 1
\end{cases}
\Leftrightarrow
\begin{cases}
C_1 = 1, \\
C_2 = -1
\end{cases}
\end{equation*}
Таким образом, экстремум может достигаться на экстремали \(y_0 = x - 1\). Она может быть включена в поле экстремалей
\(y = x + C\).
$$F_{y'y'} = 12xy'^2 - 12yy' = 12y'(xy' - y) = |_{y = y_0} 12x - 12(x - 1) = 12 > 0$$
Таким образом, на \(y_0\) достигается слабый минимум функционала. При произвольных \(y'\) знак \(F_{y'y'}\) не сохраняется,
значит, сильного минимума нет.
\section{Обобщения простейшей задачи вариационного исчисления}
\label{sec:orgfbf1209}
$$J[y] = \int_a^bF(x, y, y')dx$$
\begin{enumerate}
\item 
\end{enumerate}
\begin{equation*}
\begin{cases}
y(x) \in M, \\
z(x) \in N
\end{cases}
\rightarrow J[y, z] \in \mathbb{R}
\end{equation*}
Для поиска экстремума записывается система:
\begin{equation*}
\begin{dcases}
F_y - \frac{d}{dx}F_{y'} = 0, \\
F_z - \frac{d}{dz}F_{z'} = 0
\end{dcases}
\end{equation*}
\section{Задача 107}
\label{sec:orgfa62bf7}
\begin{equation*}
\begin{cases}
J[y(x), z(x)] = \int_0^{\frac{\pi}2}(y'^2 + z'^2 - 2yz)dx, \\
y(0) = 0, y\left(\frac{\pi}2\right) = 1, \\
z(0) = 0, z\left(\frac{\pi}2\right) = 1, \\
\end{cases}
\end{equation*}
Записываем систему уравнений Эйлера:
\begin{multline*}
\begin{cases}
-2z - 2y'' = 0, \\
-2(y + z'') = 0,
\end{cases}
\Rightarrow
\begin{cases}
z + y'' = 0, \\
y + z'' = 0
\end{cases}
\Rightarrow
\begin{cases}
z = -y'', \\
y^{IV} - y = 0
\end{cases}
\Rightarrow \\
\Rightarrow
\begin{cases}
y = C_1e^x + C_2e^{-x} + C_3\cos x + C_4\sin x, \\
z = -C_1e^x - C_2e^{-x} + C_3\cos x + C_4\sin x
\end{cases}
\end{multline*}
Подставив граничные условия, найдём:
\begin{equation*}
y = z = \sin x
\end{equaion*}
\begin{enumerate}
\item $$J[y] = \int_a^bF(x, y, y', \ldots, y^{(n)})$$
\end{enumerate}
Здесь \(F \in C^{n + 1}(D)\) и заданы \(2n\) граничных условий:
\begin{equation*}
\begin{cases}
y(a) = y_0, \\
y(b) = y_1, \\
y'(a) = y'_0, \\
y'(b) = y'_1, \\
\ldots \\
y^{(n - 1)} = y_0^{n - 1}, \\
y^{(n - 1)} = y_1^{n - 1}
\end{cases}
\end{equation*}
Уравнение Эйлера-Пуассона:
$$\sum_{k = 0}^n(-1)^k\frac{d^k}{dx^k}F_{y^{(k)}} = 0$$
Решения этого уранвения - экстремали.
\section{Задача 1}
\label{sec:orgc93e476}
\begin{equation*}
\begin{dcases}
J[y] = \int_0^{\frac{\pi}2}(y''^2 - y^2 + x^2)dx, \\
y(0) = 1, y'(0) = 0, \\
y\left(\frac{\pi}2\right) = 0, y'\left(\frac{\pi}2\right) = -1
\end{dcases}
\end{equation*}
Запишем уравнение Эйлера-Пуассона:
$$F_y - \frac{d}{dx}F_{y'} + \frac{d^2}{dx^2}F_{y''} = 0$$
$$F_y = -2y$$
$$\frac{d}{dx}F_{y'} = 0$$
$$\frac{d^2}{dx^2}F_{y''} = \frac{d^2}{dx^2}(2y'') = 2y^{IV}$$
Получили уравнение:
$$-2y + 2y^{IV} = 0$$
Или $$y^{IV} - y = 0$$
Общее решение имеет вид:
$$y = C_1e^x + C_2e^x + C_3\sin x + C_4\cos x$$
Подставим краевые условия:
\begin{equation*}
\begin{cases}
C_1 + C_2 + C_4 = 1, \\
C_1e^{\frac{\pi}2} + C_2e^{\frac{\pi}2} + C_3 = 0, \\
C_1 - C_2 + C_3 = 0, \\
C_1e^{\frac{\pi}2} - C_2e^{\frac{\pi}2} - C_4 = -1
\end{cases}
\Rightarrow
\begin{cases}
C_1 = C_2 = C_3 = 0, \\
C_4 = 1
\end{cases}
\end{equation*}
Откуда единственной экстремалью является кривая \(y = \cos x\)
\section{Условие Якоби}
\label{sec:org3027f8a}
\begin{equation*}
\begin{cases}
J[y] = \int_a^bF(x, y, y')dx, \\
y(a) = A, \\
y(b) = B
\end{cases}
\end{equation*}
Рассмотрим \textit{уравнение Якоби}:
$$(F_yy - \frac{d}{dx}F_yy')u - \frac{d}{dx}(F_{y'y'}u')|_{y = y_0} = 0$$
Где \(y_0\) - проверяемая экстремаль.


Пусть \(u(x)\) решение уравнения Якоби, удовлетворяющее условиям:
\begin{enumerate}
\item \(u(a) = 0\)
\item u(x) не обращается в нуль на \((a; b]\)
\end{enumerate}
Если такое решение существует, то экстремаль можно включить в поле экстремалей с центром в \((a, A)\).
\section{Задача 156}
\label{sec:orgf5b3d0f}
$$J[y] = \int_1^2(xy'^4 - 2yy'^3)dx; y(1) = 0, y(2) = 1$$
Экстремаль уже найдена ранее: \(y = x - 1\). Проверим её включение в поле экстремалей с помощью условия Якоби.
Выпишем уравнение Якоби:
$$(0 + \frac{d}{dx}(6y'^2))u - \frac{d}{dx}((12xy'^2 - 12yy')u') = 0$$
$$\frac{d}{dx}(y'^2)u - \frac{d}{dx}((2xy'^2 - 2yy')u') = 0$$
Подставим экстремаль:
$$-\frac{d}{dx}((2x - 2(x - 1))u') = 0 \Rightarrow (x - x + 1)u' = C \Rightarrow u = Cx + C_1$$
Вспоминая, что \(u(1) = 0\), получаем \(u = C(x - 1)\).
\section{Задача 76}
\label{sec:org1fd6479}
\begin{equation*}
\begin{cases}
J[y] = \int_0^1(y'^2 - y^2 - y)e^{2x}dx, \\
y(0) = 0, \\
y(1) = \frac{1}r
\end{cases}
\end{equation*}
Выпишем уравение Эйлера:
$$F_y - \frac{d}{dx}F_{y'} = (-2y - 1)e^2x - \frac{d}{dx}(2y'e^{2x}) = (-2y - 1)e^{2x} - 2y''e^{2x} - 2y'\cdot2$$
Общее решение имеет вид:
$$y = C_1e^{-x} + C_2xe^{-x} - \frac{1}2$$
Поле экстремалей не выделяется, нужно воспользоваться условием Якоби.
\end{document}
